Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/pay_and_employment/pay_inc_min_wage.html.txt.tmx
Source language: en
Languages: ga

source: You can find a definition of an experienced adult worker in this list of frequently asked questions on the national minimum wage
ga: Tá sainmhíniú oibrithe thaithíoch fásta ar fáil sa liosta ceisteanna coitianta faoin bpá íosta náisiúnta

source: Example 2: Mary worked for 6 months when she was 17
ga: Sampla 2: D’oibrigh Máire ar feadh 6 mhí nuair a bhí sí 17 mbliana d’aois

source: She went to college and, on 1 October 2015, at the age of 20 she started work
ga: D’fhreastail sí ar an gcoláiste agus, an 1 Deireadh Fómhair 2015, ar aois 20 bliain, thosaigh sé an obair

source: She was entitled to 80% of the minimum wage as she was in her first year of employment
ga: Bhí sí i dteideal 80% an pá íosta a fháil mar gheall go raibh sí ina céad bhliain fhostaíochta

source: On 1 June 2016 she turned 21 but her rate of pay did not increase as she was still in first year of employment after the age of 18
ga: An 1 Meitheamh 2016, bhain sí 21 bliain d’aois amach ach níor tháinig méadú ar a ráta pá mar gheall go raibh sí fós ina céad bhliain fhostaíochta i ndiaidh aois 18 mbliana

source: (Her 6-months’ work when aged 17 is not taken into account.) From 1 October 2016 she was entitled to 90% of the minimum wage as she was in her second year of employment
ga: (Ní chuirtear an obair a rinne sí ar feadh 6 mhí nuair a bhí sí 17 mbliana d’aois san áireamh.) Ón 1 Deireadh Fómhair 2016, bhí sí i dteideal 90% an pá íosta a fháil mar gheall go raibh sí ina dara bliain fhostaíochta

source: Mary changed job on 1 December 2016 but she was only entitled to 90% of the minimum wage as she continued to be in her second year of employment
ga: D’athraigh Máire a post an 1 Nollaig 2016, ach ní raibh sí i dteideal ach do 90% an pá íosta a fháil mar gheall go raibh sí fós ina dara bliain fhostaíochta

source: She is not entitled to the full minimum wage rate until 1 October 2017
ga: Níl sí i dteideal na rátaí iomlán íosta pá a fháil go dtí an 1 Deireadh Fómhair 2017

source: This is when her second year of employment ends
ga: Seo an tráth a thabharfar a dara bliain fhostaíochta chun críche

source: You can read the current and previous minimum wage rates on workplacerelations.ie
ga: Léigh tuilleadh faoi na rátaí íosphá reatha agus roimhe ar workplacerelations.ie
